Repository: maxkoshevoi/NureTimetable
Catalog: NureTimetable.Core/Localization/LN.*.resx
Languages: ru, uk

# AppName
source: NURE Timetable
ru: Расписание ХНУРЭ
uk: Розклад ХНУРЕ

# ShowErrors
source: Show all errors
ru: Показывать все ошибки
uk: Показувати усі помилки

# NoTimetable
source: Select timetable to display.
ru: Добавьте расписание для просмотра.
uk: Додайте розклад для перегляду.

source: and will always be.
ru: и всегда будет таковым.
uk: і завжди буде таким.

source: Display lesson
ru: Отображать предмет
uk: Показувати предмет

# DisplayLessonsForTypes
source: Display lesson types for this lesson:
ru: Отображать типы занятий для этого предмета:
uk: Показувати типи занять для цього предмета:

source: Donate
ru: Пожертвовать
uk: Пожертвувати

# EmptyLessonsList
source: Timetable has no lessons to display (maybe it's empty).
ru: В текущем расписании отсутствуют предметы (возможно оно пустое).
uk: В поточному розкладі відсутні предмети (можливо воно пусте).

# EventClassroom
source: Room: {0}
ru: Аудитория: {0}
uk: Аудиторія: {0}

# EventDay
source: Date: {0}
ru: День: {0}
uk: День: {0}

# EventTeachers
source: Teachers: {0}
ru: Преподаватели: {0}
uk: Викладачі: {0}

# EventTime
source: Time: {0} - {1}
ru: Время: {0} - {1}
uk: Час: {0} - {1}

# EventType
source: Type: {0}
ru: Тип: {0}
uk: Тип: {0}

# EntityLessonSettingsSaved
source: Lesson settings for "{0}" saved successfully.
ru: Настройки предметов для "{0}" успешно сохранены.
uk: Налаштування предметів для "{0}" успішно збережені.

source: is free
ru: бесплатное
uk: безкоштовний

source: Lessons
ru: Предметы
uk: Предмети

source: Notes:
ru: Заметки:
uk: Нотатки:

source: Saving settings
ru: Сохранение настроек
uk: Збереження налаштувань

# Thank
source: Say thank you
ru: Сказать спасибо
uk: Сказати дякую

# Thank2
source: Say big thank you
ru: Сказать большое спасибо
uk: Сказати великие дякую

# Thank3
source: Say huge thank you
ru: Сказать огромное спасибо
uk: Сказати величезне дякую

source: This app
ru: Это приложение
uk: Цей застосунок

# TimeUntilBreak
source: Until break ({0}): {1}
ru: До перерыва ({0}): {1}
uk: До перерви ({0}): {1}

# TimeUntilLesson
source: Until {0} ({1}): {2}
ru: До {0} ({1}): {2}
uk: До {0} ({1}): {2}

# Wait
source: Please wait...
ru: Подождите...
uk: Зачекайте...

# YourContribution
source: Your contribution supports development and doesn't let me fall into oblivion.
ru: Ваш вклад поддерживает его развитие и помогает не уходить в небытие.
uk: Ваш внесок підтримує його розвиток та допмогає не відходити в небутяння.

source: Cancel
ru: Отмена
uk: Відміна

source: Choose action
ru: Выберите действие
uk: Оберіть дію

source: Delete
ru: Удалить
uk: Видалити

source: Ok
ru: Ок
uk: Ок

# SetUpLessonDisplay
source: Lesson settings
ru: Настройки предметов
uk: Налаштування предметів

# TimetableLatest
source: Timetable is already up-to-date
ru: У вас уже загружена последняя версия расписания
uk: У вас вже завантажена остання версія розкладу

source: Timetable update
ru: Обновление расписания
uk: Оновлення розкладу

source: Update timetable
ru: Обновить расписание
uk: Оновити розклад

source: Yes
ru: Да
uk: Так

# AtFirstLoadTimetable
source: For lessons management, you need to download timetable first.
ru: Для управления предметами необходимо сначала загрузить расписание.
uk: Для керування предметами необхідно спочату завантажити розклад.

source: Error details
ru: Детали ошибки
uk: Деталі помилки

source: Lessons management
ru: Управление предметами
uk: Управління предметами

source: Purchase
ru: Покупка
uk: Покупка

source: Thanks for your support!
ru: Спасибо за вашу поддержку!
uk: Дякую за вашу підтримку!

# EventGroups
source: Groups: {0}
ru: Группы: {0}
uk: Группи: {0}

source: Adding timetable
ru: Добавление расписания
uk: Додавання розкладу

# AllEventsShown
source: All events are shown
ru: Показаны все события
uk: Показані всі події

source: Choose display mode:
ru: Выберите вид:
uk: Виберіть вид:

source: Day
ru: День
uk: День

# ErrorOccurred
source: An error occurred: {0}
ru: Произошла ошибка: {0}
uk: Виникла помилка: {0}

source: Feedback
ru: Обратная связь
uk: Зворотній зв'язок

source: Groups
ru: Группы
uk: Группи

source: Month
ru: Месяц
uk: Місяць

# NoSavedTimetables
source: You have no saved timetable.
ru: У вас нет ни одного сохранённого расписания.
uk: У вас немає жодного збереженого розкладу.

# TimetableEndReached
source: You've reached the end of timetable
ru: Вы достигли конца расписания
uk: Ви досягли кінця розкладу

# NoUniversityInfo
source: No data. To update, click on the button in the upper right corner.
ru: Данные отсутствуют. Для обновления нажмите на кнопку в правом верхнем углу.
uk: Дані відсутні. Для оновлення натисніть на кнопку в правом верхньому куті.

source: Rooms
ru: Аудитории
uk: Аудиторії

source: Saved timetables
ru: Сохранённые расписания
uk: Збережені розклади

# SelectedEventsShown
source: Selected events are shown
ru: Показаны выбранные события
uk: Показані обрані події

source: Show today
ru: Показать текущий день
uk: Показати поточний день

source: Teachers
ru: Преподаватели
uk: Викладачі

# TimetableAlreadySaved
source: Timetable "{0}" is already in saved
ru: Расписание "{0}" уже находится в сохранённых
uk: Розклад "{0}" вже знаходится в збережених

# TimetableSaved
source: Timetable "{0}" has been saved
ru: Расписание "{0}" добавлено в сохранённые
uk: Розклад "{0}" додано в збережені

# TimetableUpdated
source: Timetable has been successfully updated: {0}
ru: Расписание успешно обновлено: {0}
uk: Розклад успішно оновлено: {0}

# UniversityInfoUpdate
source: University information update
ru: Обновление информации об университете
uk: Оновлення інформації про університет

# UniversityInfoUpdateConfirm
source: Are you sure you want to update university information from Cist?
ru: Вы уверены, что хотите обновить информацию об университете из Cist?
uk: Ви впевнені, що хочете оновити інформацію про университет з Cist?

# UniversityInfoUpdateFail
source: Failed to update university information. Please try again later.
ru: Не удалось обновить информацию об университете. Пожалуйста, попробуйте позже.
uk: Не вдалось оновити інформацію про университет.Будь ласка, спробуйте пізніше.

# UniversityInfoUpdatePartiallyFail
source: Some information wasn't updated: {0}
ru: Не удалось обновить часть информации об университете: {0}
uk: Не вдалось оновити частину інформації про университет: {0}

# UniversityInfoUpToDate
source: You have already downloaded the latest version of university information
ru: У вас уже загружена последняя версия информации об университете
uk: У вас вже завантажена остання версія інформації про университет

# UpdateAllTimetables
source: Update all saved timetables?
ru: Обновить все сохранённые расписания?
uk: Оновити всі збережені розклади?

source: Week
ru: Неделя
uk: Тиждень

# DisplayLessonsForTeachers
source: Display teachers for this lesson:
ru: Отображать преподавателей для этого предмета:
uk: Відображати викладачів для цього предмета:

# FinishingUpdateDescription
source: In the new version, the data storage structure has changed. An application needs to convert data from the old format to the new one. Click OK to complete the upgrade.
ru: В новой версии поменялась структура хранения данных. Приложению нужно сконвертировать данные из старого формата, в новый. Нажмите ОК, чтобы завершить обновление.
uk: В новій версії змінилась структура зберігання даних. Застосунку потрібно сконвертувати дані зі старого формату в новий. Натисніть ОК, щоб завершити оновлення.

source: Something went wrong
uk: Щось пішло не так

# FinishingUpdateTitle
source: Finishing update
ru: Завершение обновления
uk: Завершення оновлення

# SelectOneEntity
source: Select only this one
ru: Выбрать только это
uk: Вибрати тілько це

source: Add to selected
ru: Добавить к выбранным
uk: Додати до обраних

source: Statistics:
ru: Статистика:
uk: Статистика:

# LessonName
source: Name:
ru: Название:
uk: Назва:

source: Lesson info
ru: Информация о предмете
uk: Інформація про предмет

# EventsLeft
source: left
ru: осталось
uk: залишилось

# EventsTotal
source: Classes total
ru: Всего пар
uk: Всього пар

# NextEvent
source: Next
ru: Следующая
uk: Наступна

# AddingEventToCalendarFail
source: Unable to add event to calendar
ru: Не удалось добавить пару в календарь
uk: Не вдалось додати пару в календар

# AddingEventToCalendarSuccess
source: Event has been added to calendar
ru: Пара было упешно добавлена в календарь
uk: Пара була успішно додана в календар

# AddingToCalendarTitle
source: Adding to calendar
ru: Добавление в календарь
uk: Додавання в календар

source: Choose calendar:
ru: Выберите календарь:
uk: Оберіть календар:

# CannotGetDataFromCist
source: Error getting data from cist.nure.ua. Try again later, or try using different WiFi network or mobile internet connection.
ru: Ошибка при получении данных с cist.nure.ua. Повторите попытку позже, или попробуйте использовать другую сеть WiFi или мобильный интернет.
uk: Помилка при отриманні даних з cist.nure.ua. Повторіть спробу пізніше, або спробуйте іншу мережу WiFi або мобільний інтернет.

# TimetableIsEmpty
source: Timetable doesn't contain any events
ru: Расписание не содержит ни одного события
uk: Розклад не містить жодної події

# CistException
source: Too much load on cist.nure.ua. Please try again later.
ru: Слишком большая нагрузка на cist.nure.ua. Повторите попытку позже.
uk: Занадто велике навантаження на cist.nure.ua. Будь ласка, спробуйте пізніше.

# UnsavedChangesMessage
source: Close page without saving changes?
ru: Закрыть страницу не сохраняя изменения?
uk: Закрити сторінку не зберігаючи зміни?

# UnsavedChangesTitle
source: You have unsaved changes
ru: У вас есть несохраненные изменения
uk: У вас є незбережені зміни

source: Events
ru: Пары
uk: Пари

source: Menu
ru: Меню
uk: Меню

source: Timetables
ru: Расписания
uk: Розклади

# DarkTheme
source: Dark
ru: Тёмная
uk: Темна

source: Follow system
ru: Как в системе
uk: Як у системі

source: Language
ru: Язык
uk: Мова

# LightTheme
source: Light
ru: Светлая
uk: Світла

source: Theme
ru: Тема
uk: Тема

source: Rate the app
ru: Оцените приложение
uk: Оцініть додаток

source: Source code
ru: Исходный код
uk: Початковий код

# Version
source: Version {0}
ru: Версия {0}
uk: Версія {0}

source: Restart required
ru: Необходим перезапуск
uk: Необхідний перезапуск

source: Enter name...
ru: Введите имя...
uk: Введіть ім'я...

# InsufficientRights
source: The application does not have sufficient rights to perform this action
ru: У приложения нет достаточных прав на выполнение этого действия
uk: У додатку немає достатніх прав на виконання цієї дії

source: Undo
ru: Отменить
uk: Скасувати

# PurchaseFailed
source: Something went wrong, purchase failed.
ru: Что-то пошло не так, покупка не удалась.
uk: Щось пішло не так, покупка не вдалась.

source: Default calendar
ru: Календарь по умолчанию
uk: Календар за замовчуванням

source: Ask every time
ru: Спрашивать каждый раз
uk: Питати щоразу

# AutoupdateFailed
source: Autoupdate failed. Try updating timetable manually.
ru: Ошибка автообновления. Попробуйте обновить расписание вручную.
uk: Помилка автообновлення. Спробуйте оновити розклад вручну.

source: Other settings
ru: Другие настройки
uk: Інші налаштування

source: Settings
ru: Настройки
uk: Налаштування

# AutoupdateDescription
source: Automatically update selected timetables
ru: Автоматически обновлять выбранные расписания
uk: Автоматично оновити обрані розклади

source: Autoupdate
ru: Автообновление
uk: Автооновлення

# EmptyUniversityInfoSearch
source: Search returned no results. To update the list, click on the button in the upper right corner.
ru: Поиск не дал результатов. Чтобы обновить список, нажмите кнопку в правом верхнем углу.
uk: Пошук не дав результатів. Щоб оновити список, натисніть кнопку у верхньому правому куті.

source: Add to calendar
ru: Добавить в календарь
uk: Додати в календар

source: Lesson management
ru: Управление предметом
uk: Управління предметом

# MinutesBefore
source: {0} minutes before
ru: За {0} минут
uk: За {0} хвилин

# TimeBeforeEventReminder
source: Reminder before calendar event
ru: Уведомление до пары в календаре
uk: Повідомлення до пари в календарі

source: Turned off
ru: Выключено
uk: Вимкнено

source: DL Nure Integration
uk: Інтеграція з DL Nure

# DlNureLoggedIn
source: Logged in as: {0} ({1})
uk: Ви увійшли як: {0} ({1})

# DlNureSignedOut
source: Turned off
uk: Вимкнена

# LoggedInAs
source: Logged in as: {0} ({1})
uk: Ви увійшли як: {0} ({1})

# DlNureIntegrationDescription
source: DL Nure integration enables: - Attendance management for ongoing event - Automatic lesson filtering Credentials are stored locally.
uk: Інтеграція DL Nure дозволяє: - Управління відвідуваністю пари, що триває - Автоматична фільтрація уроків Облікові дані зберігаються локально.

source: Password
uk: Пароль

# DlNureEmail
source: @nure.ua email
uk: Електронна адреса @nure.ua
